---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewerIsReference
source: html/14f39593-7161-f087-6a37-c570de465733.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewerIsReference Property

"Is a Reference"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewerIsReference { get; }
```